config-02/emacs.org
# -*- coding: utf-8 -*-

#+TITLE: Emacs Configuration
#+AUTHOR: Parag Chaudhuri
#+EMAIL: paragc@cse.iitb.ac.in
#+DESCRIPTION: Personal Emacs Config (PEC)
#+language: en
#+options: ':t toc:nil num:t author:t email:t
#+STARTUP: content indent
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

*Last exported on {{{latest-export-date}}} with a word
count of {{{word-count}}}.*

This is a literate Emacs configuration file.

To generate the actual emacs configuration files we tangle this file with =C-c C-v C-t=.


* Early Initialization for Emacs (=early-init.el=)
:PROPERTIES:
:CUSTOM_ID: h-7b7b5898-09f7-4128-8af0-4041f67cb729
:END:

We will use the Elpaca package manager so we are disabling the in-built package manager in early initialization.

#+begin_src emacs-lisp :tangle "early-init.el"

  ;; Disabling inbuilt packages for Elpaca
  (setq package-enable-at-startup nil)

  ;; Every file opened and loaded by Emacs will run through this list to check for
  ;; a proper handler for the file, but during startup, it won’t need any of them.
  ;; This is reset in posimacs-init.el after `elpaca-after-init-hook' it is reset
  ;; to the original value.
  (defvar file-name-handler-alist--old file-name-handler-alist)

  ;; https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/
  ;; Note, `gcmh' package will modify this later, so we don't reset it.
  (setq gc-cons-threshold most-positive-fixnum
        file-name-handler-alist nil)

  ;; Use the no-littering var directory for elisp native compile cache
  (when (fboundp 'startup-redirect-eln-cache)
    (startup-redirect-eln-cache
     (convert-standard-filename
          (expand-file-name  "var/eln-cache/" user-emacs-directory))))

  ;; Turn off graphics features that would slow down initial startup.
  ;; https://github.com/Gavinok/emacs.d  
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t 
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name 
        inhibit-startup-buffer-menu t
        package-native-compile t
        default-frame-alist
        '((tool-bar-lines . 0)
          (menu-bar-lines . 0)
          ;;(undecorated . t)
          (vertical-scroll-bars . nil)
          (horizontal-scroll-bars . nil)))

#+end_src


* Main Initialization for Emacs - Preamble (=init.el=)

We enable lexical binding for =init.el=.
For more information, see [[https://www.emacswiki.org/emacs/LexicalBinding][https://www.emacswiki.org/emacs/LexicalBinding]]

#+begin_src emacs-lisp :tangle "init.el"
  ;; -*- lexical-binding: t -*-
  
#+end_src


* Important Programs To Load First

** Setting up the Package Manager =elpaca.el=

#+begin_src emacs-lisp :tangle "init.el"

  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "etc/elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))

  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                   ,@(when-let ((depth (plist-get order :depth)))
                                                       (list (format "--depth=%d" depth) "--no-single-branch"))
                                                   ,(plist-get order :repo) ,repo))))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode))

#+end_src

** Keeping Emacs Clean - =no-littering.el=

#+begin_src emacs-lisp :tangle "init.el"

  ;; Loading no-littering early
  (elpaca no-littering
    (require 'no-littering))

  ;; Making sure etc/custom.el gets all customizations

  (elpaca-wait) ;let all elpaca queues finish before proceeding

  
#+end_src

** Idle Garbage Collection

#+begin_src emacs-lisp :tangle "init.el"

    ;; See posimacs-early-init.el for initial replacement.
    (defun pec--elpaca-after-init ()
      "Undo filename handler trick and delete self for fun."

    ;; Making sure etc/custom.el gets all customizations
    (load
      (setq custom-file (expand-file-name "customs.el" user-emacs-directory))
     'noerror)

      (setq file-name-handler-alist file-name-handler-alist--old)
      (remove-hook 'elpaca-after-init-hook #'pec--elpaca-after-init)
      (fmakunbound #'pec--elpaca-after-init)
      (makunbound 'file-name-handler-alist--old))

    (add-hook 'elpaca-after-init-hook #'pec--elpaca-after-init)

    ;; Idle garbage collection
    (use-package gcmh
      :ensure t
      :demand t
      :config
      (add-hook 'elpaca-after-init-hook (lambda () (gcmh-mode 1))))

#+end_src

** Load Evil Mode

#+begin_src emacs-lisp :tangle "init.el"

    (use-package evil
      :ensure t
      :demand t
      :init
      (setq evil-want-integration t)
      (setq evil-want-keybinding nil)
      (setq evil-vsplit-window-right t)
      (setq evil-split-window-below t)
      (evil-mode)
      (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
      (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

      ;;Use visual line motions even outside of visual-line-mode buffers
      ;;(evil-global-set-key 'motion "j" 'evil-next-visual-line)
      ;;(evil-global-set-key 'motion "k" 'evil-previous-visual-line)

      ;;Do not use evil mode in some buffers
      ;(evil-set-initial-state 'messages-buffer-mode 'normal)
      ;(evil-set-initial-state 'dashboard-mode 'normal)
      )

    (use-package evil-collection
      :after evil
      :after magit
      :config
      (setq evil-collection-mode-list '(dashboard dired ibuffer))
      (evil-collection-init))

    ;;(use-package evil-tutor)

#+end_src

** General Keybindings

#+begin_src emacs-lisp :tangle "init.el"

  (use-package general
    :ensure (:wait t)
    :demand t
    :config
    (general-evil-setup)

    ;; set up 'SPC' as the global leader key
    (general-create-definer pec/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC" ;; set leader
      :non-normal-prefix "S-SPC") ;; access leader in insert mode

    (pec/leader-keys
      "SPC" '(execute-extended-command :wk "M-x alternate")
      "." '(consult-fd :wk "Find file")
      "f c" '((lambda () (interactive) (find-file ~/.config/emacs/emacs.org)) :wk "Edit emacs config")
      "TAB TAB" '(comment-line :wk "Comment lines"))
    
    (pec/leader-keys
      "b" '(:ignore t :wk "buffer")
      "b b" '(consult-buffer :wk "Switch buffer")
      "b i" '(ibuffer :wk "Ibuffer")
      "b k" '(kill-this-buffer :wk "Kill this buffer")
      "b n" '(next-buffer :wk "Next buffer")
      "b p" '(previous-buffer :wk "Previous buffer")
      "b r" '(revert-buffer :wk "Reload buffer"))
    
    (pec/leader-keys
      "d" '(:ignore t :wk "Dired")
      "d d" '(dired :wk "Open dired")
      "d j" '(dired-jump :wk "Dired jump to current")
      "d n" '(neotree-dir :wk "Open directory in neotree")
      "d p" '(dired-preview-global-mode :wk "Dired preview mode toggle"))
    
    (pec/leader-keys
      "e" '(:ignore t :wk "Evaluate")
      "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
      "e d" '(eval-defun :wk "Evaluate defun containing or after point")
      "e e" '(eval-expression :wk "Evaluate an eLisp expression")
      "e l" '(eval-last-sexp :wk "Evaluate eLisp expression before point")
      "e r" '(eval-region :wk "Evaluate eLisp in region")
      "e s" '(eshell :wk "Wshell")
      "e h" '(consult-history :wk "Eshell history"))

    (pec/leader-keys
      "h" '(:ignore t :wk "Help")
      "h f" '(describe-function :wk "Describe function")
      "h t" '(load-theme :wk "Load theme")
      "h v" '(describe-variable :wk "Describe variable")
      "h r r" '((lambda () (interactive)
  		(load-file user-init-file)
  		(ignore (elpaca-process-queues)))
  	      :wk "Reload Emacs init.el"))

    (pec/leader-keys
      "m" '(:ignore t :wk "Org")
      "m a" '(org-agenda :wk "Org agenda") 
      "m b" '(org-babel-tangle :wk "Org babel tangle")
      "m e" '(org-export-dispath :wk "Org export dispatch")
      "m i" '(org-toggle-item :wk "Org toggle item")
      "m h" '(consult-org-heading :wk "Goto Org heading")
      "m t" '(org-todo :wk "Org todo")
      "m T" '(org-todo-list :wk "Org todo list"))

    (pec/leader-keys
      "m l" '(:ignore t :wk "Org tables")
      "m l -" '(org-table-insert-hline :wk "Insert hline in table"))

    (pec/leader-keys
      "m d" '(:ignore t :wk "Org date/deadline")
      "m d t" '(org-time-stamp :wk "Org time stamp"))
      
    (pec/leader-keys
     "t" '(:ignore t :wk "Toggle")
     "t l" '(display-line-numbers-mode :wk "Toggle line numbers")
     "t t" '(visual-line-mode :wk "Toggle truncated lines")
     "t v" '(vterm-toggle :wk "Toggle vterm"))

    (pec/leader-keys
     "w" '(:ignore t :wk "Windows")
     "w c" '(evil-window-delete :wk "Close window")
     "w n" '(evil-window-new :wk "New window")
     "w s" '(evil-window-split :wk "Horizontal split window")
     "w v" '(evil-window-vsplit :wk "Vetically split window")

     "w <left>" '(evil-window-left :wk "Window left")
     "w <down>" '(evil-window-down :wk "Window down")
     "w <up>" '(evil-window-up :wk "Window up")
     "w <right>" '(evil-window-right :wk "Window right")
     "w w" '(evil-window-next :wk "Goto next window")

     "w H" '(buf-move-left :wk "Buffer move left")
     "w J" '(buf-move-down :wk "Buffer move down")
     "w K" '(buf-move-up :wk "Buffer move up")
     "w L" '(buf-move-right :wk "Buffer move right"))

    (pec/leader-keys
      "o" '(ace-window :wk "Ace window"))
    )

#+end_src


* Window and Buffer Move

** ace-window

#+begin_src emacs-lisp :tangle "init.el"

  (use-package ace-window
    :ensure t
    :diminish
    :config (ace-window-display-mode 1)
    )
  
#+end_src

** buffer-move

#+begin_src emacs-lisp :tangle "init.el"

  (use-package buffer-move
    :ensure t
    :bind (
           ("C-S-<up>" . buf-move-up)
           ("C-S-<down>" . buf-move-down)
           ("C-S-<left>" . buf-move-left)
           ("C-S-<right>" . buf-move-right))
    )

#+end_src


* Completions

** Vertico

#+begin_src emacs-lisp :tangle "init.el"

    (use-package vertico
    	:ensure t
    	:demand t
    	:bind (:map vertico-map
    		    ("C-j" . vertico-next)
    		    ("C-k" . vetico-previous)
    		    ("C-f" . vertico-exit)
    		    :map minibuffer-local-map
    		    ("M-h" . backward-kill-word))
    	:custom
    	(vertico-cycle t)
    	:init
    	(vertico-mode))

    (use-package savehist
    	:init
    	(savehist-mode))
  
    ;; A few more useful configurations...
  (use-package emacs
    :custom
    ;; Support opening new minibuffers from inside existing minibuffers.
    (enable-recursive-minibuffers t)
    ;; Emacs 28 and newer: Hide commands in M-x which do not work in the current
    ;; mode.  Vertico commands are hidden in normal buffers. This setting is
    ;; useful beyond Vertico.
    (read-extended-command-predicate #'command-completion-default-include-p)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode))


#+end_src

** Orderless

#+begin_src emacs-lisp :tangle "init.el"

  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))

#+end_src

